#+title: Config Org for my Doom Emacs
#+author: Vedaant Rajoo
#+property: header-args :tangle config.el
#+auto_tangle: t
#+startup: showeverything

* START PAGE
#+BEGIN_SRC emacs-lisp
(setq initial-buffer-choice "~/.doom.d/start.org")
(add-hook 'start-mode-hook 'read-only-mode) ;; make start.org read-only; use 'SPC t r' to toggle off read-only.
#+END_SRC
#+RESULTS:
| sequence | TODO(t) | BLOG(b) | GYM(g) | PROJ(p) | VIDEO(v) | WAIT(w) |   |   | DONE(d) | CANCELLED(c) |
